import React from "react";

const Documentation = () => {
  return (
    <div className="documentation">
      <h2>Для кого этот сайт?</h2>
      <p>
        Данный сайт предназначен для всех желающих наладить свой распорядок дня
        и внести в свою жизнь дисциплину
      </p>
      <h2>Как им пользоваться?</h2>
      <p>
        Пользоваться сайтом не так уж и сложно, все до банального просто: <br />
        На сайте можно добавлять и удалять различные задачи. <br />
        КНОПКА "ДОБАВИТЬ ЗАДАЧУ" собственно при нажатии на кнопку всплывает
        диалоговое окно:
      </p>
      <img src="addwindow.png" alt="Окно добавления задачи" />
      <p>
        в котором можно ввести название задачи(под каким названием она будет
        отображаться в интерфейсе) или отменить действие - в таком случае ничего
        не произойдет. После введения названия нас встречает следующее
        диалоговое окно:
      </p>
      <img src="priorwindow.png" alt="Окно приоритета задачи" />
      <br />
      <br />
      <br />
      <br />
      <br />
      <br />
      <br />
      <br />
      <p>dsfg</p>
    </div>
  );
};

export default Documentation;
